In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1={'Name':['Reshma','Santosh',np.nan,'Mayank'],
        'Age':[30,40,np.nan,20],
          'City':[np.nan,'Mumbai','pune','Chenai']}
dict1

{'Name': ['Reshma', 'Santosh', nan, 'Mayank'],
 'Age': [30, 40, nan, 20],
 'City': [nan, 'Mumbai', 'pune', 'Chenai']}

In [3]:
data1=pd.DataFrame(dict1)
data1

      Name   Age    City
0   Reshma  30.0     NaN
1  Santosh  40.0  Mumbai
2      NaN   NaN    pune
3   Mayank  20.0  Chenai

In [4]:
#Missing Value
data1.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2   True   True  False
3  False  False  False

In [5]:
data1.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

In [6]:
data1.isnull().sum()*100/len(data1)

Name    25.0
Age     25.0
City    25.0
dtype: float64

In [7]:
dict2={'Name':['Reshma','Santosh',None,'Mayank'],
        'Age':[30,40,None,20],
          'City':[None,'Mumbai','pune','Chenai']}
dict2

{'Name': ['Reshma', 'Santosh', None, 'Mayank'],
 'Age': [30, 40, None, 20],
 'City': [None, 'Mumbai', 'pune', 'Chenai']}

In [8]:
data2=pd.DataFrame(dict2)
data2

      Name   Age    City
0   Reshma  30.0    None
1  Santosh  40.0  Mumbai
2     None   NaN    pune
3   Mayank  20.0  Chenai

In [9]:
data2.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2   True   True  False
3  False  False  False

In [10]:
data2.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

In [11]:
data2.isnull().sum()*100/len(data2)

Name    25.0
Age     25.0
City    25.0
dtype: float64

In [12]:
dict3={'Name':['Reshma','Santosh','Null','Mayank'],
        'Age':[30,40,'Null',20],
          'City':['Null','Mumbai','pune','Chenai']}
data3=pd.DataFrame(dict3)
data3

      Name   Age    City
0   Reshma    30    Null
1  Santosh    40  Mumbai
2     Null  Null    pune
3   Mayank    20  Chenai

In [13]:
data3.isnull()

    Name    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [14]:
data3.isnull().sum()

Name    0
Age     0
City    0
dtype: int64

In [15]:
data3.isnull().sum()*100/len(data3)

Name    0.0
Age     0.0
City    0.0
dtype: float64

In [16]:
#method1
#fill the missing value with random Number all values are filled with 40
data1.fillna(40)

      Name   Age    City
0   Reshma  30.0      40
1  Santosh  40.0  Mumbai
2       40  40.0    pune
3   Mayank  20.0  Chenai

In [17]:
#method2
#fill the missing value with random Number at specific column 
data1['Name'].fillna('Santosh',inplace=True)
data1

      Name   Age    City
0   Reshma  30.0     NaN
1  Santosh  40.0  Mumbai
2  Santosh   NaN    pune
3   Mayank  20.0  Chenai

In [18]:
#Method3
dict1={'Name':['Reshma','Santosh',np.nan,'Mayank'],
        'Age':[30,40,np.nan,20],
          'City':[np.nan,'Mumbai','pune','Chenai']}
dict1

{'Name': ['Reshma', 'Santosh', nan, 'Mayank'],
 'Age': [30, 40, nan, 20],
 'City': [nan, 'Mumbai', 'pune', 'Chenai']}

In [19]:
#Method3.A
data1.fillna(method='backfill')

      Name   Age    City
0   Reshma  30.0  Mumbai
1  Santosh  40.0  Mumbai
2  Santosh  20.0    pune
3   Mayank  20.0  Chenai

In [20]:
#Method3B
dict1={'Name':['Reshma','Santosh',np.nan,'Mayank'],
        'Age':[30,40,np.nan,20],
          'City':[np.nan,'Mumbai','pune','Chenai']}
data1=pd.DataFrame(dict1)
data1.fillna(method='bfill')

      Name   Age    City
0   Reshma  30.0  Mumbai
1  Santosh  40.0  Mumbai
2   Mayank  20.0    pune
3   Mayank  20.0  Chenai

In [21]:
#Method3B
dict1={'Name':['Reshma','Santosh',np.nan,'Mayank'],
        'Age':[30,40,np.nan,20],
          'City':[np.nan,'Mumbai','pune','Chenai']}
data1=pd.DataFrame(dict1)
data1.fillna(method='ffill')

      Name   Age    City
0   Reshma  30.0     NaN
1  Santosh  40.0  Mumbai
2  Santosh  40.0    pune
3   Mayank  20.0  Chenai

In [22]:
#Method3B
dict1={'Name':['Reshma','Santosh',np.nan,'Mayank'],
        'Age':[30,40,np.nan,20],
          'City':[np.nan,'Mumbai','pune','Chenai']}
data1=pd.DataFrame(dict1)
data1.fillna(method='pad')

      Name   Age    City
0   Reshma  30.0     NaN
1  Santosh  40.0  Mumbai
2  Santosh  40.0    pune
3   Mayank  20.0  Chenai

In [23]:
#Method4-Median
dict1={'Name':['Reshma','Santosh',np.nan,'Mayank'],
        'Age':[30,40,np.nan,20],
          'City':[np.nan,'Mumbai','pune','Chenai']}
data1=pd.DataFrame(dict1)
ageMedian=data1['Age'].median()
data1.fillna(ageMedian)

      Name   Age    City
0   Reshma  30.0    30.0
1  Santosh  40.0  Mumbai
2     30.0  30.0    pune
3   Mayank  20.0  Chenai

In [24]:
#Method5=Meqn
dict1={'Name':['Reshma','Santosh',np.nan,'Mayank'],
        'Age':[30,40,np.nan,20],
          'City':[np.nan,'Mumbai','pune','Chenai']}
data1=pd.DataFrame(dict1)
AgeMean=data1['Age'].mean()
print(AgeMean)
data1.fillna(AgeMean)

30.0

      Name   Age    City
0   Reshma  30.0    30.0
1  Santosh  40.0  Mumbai
2     30.0  30.0    pune
3   Mayank  20.0  Chenai

In [25]:
#Method5=Mode
dict1={'Name':['Reshma','Santosh',np.nan,'Mayank'],
        'Age':[30,40,np.nan,20],
          'City':[np.nan,'Mumbai','pune','Chenai']}
data1=pd.DataFrame(dict1)
ageMode=data1['Age'].mode()
data1.fillna(ageMode)

      Name   Age    City
0   Reshma  30.0     NaN
1  Santosh  40.0  Mumbai
2      NaN   NaN    pune
3   Mayank  20.0  Chenai

In [26]:
#method-6
#KNNImputer Package
from sklearn.impute import KNNImputer
knn=KNNImputer()
dMean=knn.fit_transform(data1[['Age']])
dMean

array([[30.],
       [40.],
       [30.],
       [20.]])